// 作业2
// 实现函数, 用于画一个矩形, 长宽由参数提供
// 参数 x, y 是左上角坐标
// 参数 w, h 是长宽
// 函数声明如下
// rect(x, y, w, h)

/* 提示:
* 根据例子 1 的程序修改
* 
* 分步提示:
* 1. 考虑矩形只重复两次(一次会画出长和宽), 所以只需要循环 2 次
* 2. 每次循环做几个操作
*     i 递增 1
*     往前移动 w
*     右转 90 度
*     往前移动 h
*     右转 90 度
*/

// 以下是提交作业代码
/* ------------------------------------------------------------------------- */
var rect = function(x, y, w, h) {
    jump(x, y)
    setHeading(0)
    var i = 0
    while (i < 2) {
        forward(w)
        right(90)
        forward(h)
        right(90)
        i = i + 1
    }
}

setDelay(0)
rect(0, 0, 66, 88)
